var cityArr = [
	"上海",
	"上海崇明", {
		"江苏": [
			"常州",
			"淮安",
			"连云港",
			"南京",
			"南通",
			"苏州",
			"泰州",
			"无锡",
			"宿迁",
			"徐州",
			"盐城",
			"扬州",
			"镇江",
			"泰州",
			"无锡",
			"宿迁",
			"徐州",
			"盐城",
			"扬州",
			"镇江"
		]
	}, {
		"浙江": [
			"杭州",
			"湖州",
			"嘉兴",
			"金华",
			"丽水",
			"宁波",
			"衡州",
			"绍兴",
			"台州",
			"温州",
			"舟山"
		]
	}, {
		"安徽": [
			"安庆",
			"蚌埠",
			"亳州",
			"池州",
			"滁州",
			"阜阳",
			"合肥",
			"淮北",
			"淮南",
			"黄山",
			"六安",
			"马鞍山",
			"铜陵",
			"芜湖",
			"宿州",
			"宣城"
		]
	},
	"北京",
	"天津", {
		"河北": [
			"石家庄",
			"廊坊",
			"承德",
			"唐山",
			"保定",
			"沧州",
			"邯郸",
			"衡水",
			"秦皇岛",
			"邢台",
			"张家口"
		]
	}, {
		"广东": [
			"深圳",
			"广州",
			"珠海",
			"汕头",
			"韶关",
			"佛山",
			"江门",
			"湛江",
			"茂名",
			"肇庆",
			"惠州",
			"梅州",
			"汕尾",
			"河源",
			"阳江",
			"清远",
			"东莞",
			"中山",
			"揭阳",
			"云浮",
			"潮州"
		]
	}
]