<template>
  <div>

  </div>
</template>

<script>
export default {
// **************************************************组件注册使用
// 旧知识：面对重复JS代码
//     1、函数封装 ：变量局部，不会污染别人！
//     2、函数在页面中调用！

// 新知识：
//     1、如何封装  特别"函数" --->组件
//        components：组件们 零件们  html css js三块
//     2、如何调用？
//          1、模块化：导入！
//          2、注册下：components:{注册}
//          3、"调用": 当做一个普通标签！

// 注册：
//     1、局部：导入到某个vue文件，局部！只能在当前这个vue文件内使用！
//     2、全局：导入main.js文件！所有vue文件内都可以使用该组件！
// 命名：大驼峰命名，小横线使用


// ****************************************************父子组件通信
// 父给子：形参实参！
//     子组件就是所谓函数，设置所谓形参！props:["形参名"] 常用写法！
//     父组件内调用子组件的时候，传入实参！


// 子给父：收发信号！
//     子组件：给父级发送信号！this.$emit("通道名称",...发送的数据)
//     父级组件：在使用子组件的时候  <子   @通道名称="函数">  函数(形参){拿到发送过来的数据}
}
</script>

<style>

</style>