<template>
  
  <div class="box">
    <!-- 2 使用：形参用到时候，当做变量！类似data初始化内数据变量！ -->
    <h3>标题：{{title}}</h3>
    <p>价格：{{price}}元</p>
    <p>开业大酬宾，全场{{num}}折</p>
    <h4>库存：{{kc}} 件 </h4>
    <button @click="fn">卖一件</button>
  </div>
</template>

<script>
export default {
  // 特别封装：如何设置所谓形参！
  props:["title","price","num","kc","id"], // 1、设置形参：名是字符串！语法固定！


  // 卖一件：
  //    1、子组件自己 kc--
  //    2、报错：数据是父级给的，如果要修改数据，应该是让父级去修改数据！
  //       规定：子组件不能直接去修改父组件传入的数据！vue注重数据！不然会造成数据紊乱！
  //    3、解决：如何让子组件给父级发个短信，去修改数据！谁给的数据，就让谁改！  子给父级传递数据！
  //           1、接受父级给的id、唯一标识 、身份证 发信号给父级：告诉父级自己是哪个！这样父级才能操作！
  //           2、子组件  点击卖一件按钮：学习发送信号的语法！
  //           3、App.vue 学习接受信号的语法！  @通道名称="执行函数"   执行函数(形参){  拿到发送过来的数据 }
  methods:{
    fn(){
      // 发送： 内置封装好方法  emit发射  this.$emit("通道名称",要发送的数据,...) 
      //        通道名称：自定义事件名称 应用@xxx
      this.$emit("aaa",this.id);
    }
  }



}
</script>

<style scoped>
  .box {
    border: 1px solid #000;
  }
</style>